# Exporter IFCUtils Get Num Building Storeys Method

Source: https://www.revitapidocs.com/2026/c6bdcbc0-4c99-237b-ea4d-a243d38b819a.htm

---

| Exporter IFCUtils Get Num Building Storeys Method |
| --- |

**Note: This API is now obsolete.**

Returns the number of non\-empty, non\-duplicate building stories in the file.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")]
public static int GetNumBuildingStoreys(
	ExporterIFC exporterIFC
)
```

```
<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")>
Public Shared Function GetNumBuildingStoreys (
	exporterIFC As ExporterIFC
) As Integer
```

```
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")]
static int GetNumBuildingStoreys(
	ExporterIFC^ exporterIFC
)
```

```
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")>]
static member GetNumBuildingStoreys :
        exporterIFC : ExporterIFC -> int
```

#### Parameters

exporterIFC ExporterIFC
:   The exporter.

#### Return Value

Int32
The number of stories. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

ExporterIFCUtils Class Autodesk.Revit.DB.IFC Namespace